[
  {"id":"BrosOstl04","type":"article-journal","container-title":"Nature","DOI":"10.1038/nature02297","issue":"6979","page":"167-171","title":"Unified spatial scaling of species and their trophic interactions","URL":"http://dx.doi.org/10.1038/nature02297","volume":"428","author":[{"family":"Brose","given":"Ulrich"},{"family":"Ostling","given":"Annette"},{"family":"Harrison","given":"Kateri"},{"family":"Martinez","given":"Neo D."}],"issued":{"date-parts":[[2004]]}},
  {"id":"doumaAnalysingContinuousProportions2019","type":"article-journal","abstract":"Abstract Proportional data, in which response variables are expressed as percentages or fractions of a whole, are analysed in many subfields of ecology and evolution. The scale-independence of proportions makes them appropriate to analyse many biological phenomena, but statistical analyses are not straightforward, since proportions can only take values from zero to one and their variance is usually not constant across the range of the predictor. Transformations to overcome these problems are often applied, but can lead to biased estimates and difficulties in interpretation. In this paper, we provide an overview of the different types of proportional data and discuss the different analysis strategies available. In particular, we review and discuss the use of promising, but little used, techniques for analysing continuous (also called non-count-based or non-binomial) proportions (e.g. percent cover, fraction time spent on an activity): beta and Dirichlet regression, and some of their most important extensions. A major distinction can be made between proportions arising from counts and those arising from continuous measurements. For proportions consisting of two categories, count-based data are best analysed using well-developed techniques such as logistic regression, while continuous proportions can be analysed with beta regression models. In the case of >2 categories, multinomial logistic regression or Dirichlet regression can be applied. Both beta and Dirichlet regression techniques model proportions at their original scale, which makes statistical inference more straightforward and produce less biased estimates relative to transformation-based solutions. Extensions to beta regression, such as models for variable dispersion, zero-one augmented data and mixed effects designs have been developed and are reviewed and applied to case studies. Finally, we briefly discuss some issues regarding model fitting, inference, and reporting that are particularly relevant to beta and Dirichlet regression. Beta regression and Dirichlet regression overcome some problems inherent in applying classic statistical approaches to proportional data. To facilitate the adoption of these techniques by practitioners in ecology and evolution, we present detailed, annotated demonstration scripts covering all variations of beta and Dirichlet regression discussed in the article, implemented in the freely available language for statistical computing, r.","container-title":"Methods in Ecology and Evolution","DOI":"10.1111/2041-210X.13234","ISSN":"2041-210X","issue":"9","page":"1412-1430","source":"besjournals.onlinelibrary.wiley.com (Atypon)","title":"Analysing continuous proportions in ecology and evolution: A practical introduction to beta and Dirichlet regression","title-short":"Analysing continuous proportions in ecology and evolution","URL":"https://besjournals.onlinelibrary.wiley.com/doi/full/10.1111/2041-210X.13234","volume":"10","author":[{"family":"Douma","given":"Jacob C."},{"family":"Weedon","given":"James T."}],"accessed":{"date-parts":[[2019,11,11]]},"issued":{"date-parts":[[2019,9,1]]},"container-title-short":"Methods in Ecology and Evolution"},
  {"id":"WillMart04","type":"article-journal","abstract":"While trophic levels have found broad application throughout ecology, they are also in much contention on analytical and empirical grounds. Here, we use a new generation of data and theory to examine long‐standing questions about trophic‐level limits and degrees of omnivory. The data include food webs of the Chesapeake Bay, U.S.A., the island of Saint Martin, a U.K. grassland, and a Florida seagrass community, which appear to be the most trophically complete food webs available in the primary literature due to their inclusion of autotrophs and empirically derived estimates of the relative energetic contributions of each trophic link. We show that most (54%) of the 212 species in the four food webs can be unambiguously assigned to a discrete trophic level. Omnivory among the remaining species appears to be quite limited, as judged by the standard deviation of omnivores’ energy‐weighted food‐chain lengths. This allows simple algorithms based on binary food webs without energetic details to yield surprisingly accurate estimates of species’ trophic and omnivory levels. While maximum trophic levels may plausibly exceed historically asserted limits, our analyses contradict both recent empirical claims that these limits are exceeded and recent theoretical claims that rampant omnivory eliminates the scientific utility of the trophic‐level concept.","container-title":"The American Naturalist","DOI":"10.1086/381964","ISSN":"0003-0147","issue":"3","page":"458-468","source":"journals.uchicago.edu (Atypon)","title":"Limits to Trophic Levels and Omnivory in Complex Food Webs: Theory and Data.","title-short":"Limits to Trophic Levels and Omnivory in Complex Food Webs","URL":"https://www.journals.uchicago.edu/doi/abs/10.1086/381964","volume":"163","author":[{"family":"Williams","given":"Richard J."},{"family":"Martinez","given":"Neo D."}],"accessed":{"date-parts":[[2019,11,8]]},"issued":{"date-parts":[[2004,3,1]]},"container-title-short":"The American Naturalist"},
  {"id":"CanaMouq12","type":"article-journal","container-title":"PLoS ONE","DOI":"10.1371/journal.pone.0038295","issue":"8","page":"e38295","title":"Emergence of Structural Patterns in Neutral Trophic Networks","volume":"7","author":[{"family":"Canard","given":"Elsa"},{"family":"Mouquet","given":"Nicolas"},{"family":"Marescot","given":"Lucile"},{"family":"Gaston","given":"Kevin J."},{"family":"Gravel","given":"Dominique"},{"family":"Mouillot","given":"David"}],"issued":{"date-parts":[[2012,8]]}},
  {"id":"DunnWill02a","type":"article-journal","container-title":"Proc. Natl. Acad. Sci. U. S. A.","issue":"20","page":"12917","title":"Food-web structure and network theory: the role of connectance and size","volume":"99","author":[{"family":"Dunne","given":"Jennifer A"},{"family":"Williams","given":"Richard J"},{"family":"Martinez","given":"Néo D"}],"issued":{"date-parts":[[2002]]}},
  {"id":"PascDunn06","type":"book","abstract":"This book is based on proceedings from a February 2004 Santa Fe Institute workshop. Its contributing chapter authors treat the ecology of predator-prey interactions and food web theory, structure, and dynamics, joining researchers who also work on complex systems and on large nonlinear networks from the points of view of other sub-fields within ecology. Food webs play a central role in the debates on the role of complexity in stability, persistence, and resilience. Better empirical data and the exploding interest in the subject of networks across social, physical, and natural sciences prompted creation of this volume. The book explores the boundaries of what is known of the relationship between structure and dynamics in ecological networks and defines directions for future developments in this field.","ISBN":"978-0-19-518816-5","language":"en","number-of-pages":"405","publisher":"Oxford University Press, USA","source":"Google Books","title":"Ecological Networks: Linking Structure to Dynamics in Food Webs","title-short":"Ecological Networks","author":[{"family":"Pascual","given":"Mercedes"},{"family":"Dunne","given":"Jennifer A."}],"issued":{"date-parts":[[2006]]}},
  {"id":"CoheBria84","type":"article-journal","container-title":"Proc Natl Acad Sci U S A","issue":"13","page":"4105-4109","title":"Trophic links of community food webs.","volume":"81","author":[{"family":"Cohen","given":"J. E."},{"family":"Briand","given":"F."}],"issued":{"date-parts":[[1984]]}},
  {"id":"PoisCirt16","type":"article-journal","container-title":"Methods in Ecology and Evolution","DOI":"10.1111/2041-210X.12468","ISSN":"2041210X","issue":"3","language":"en","page":"303-312","source":"CrossRef","title":"The structure of probabilistic networks","URL":"http://doi.wiley.com/10.1111/2041-210X.12468","volume":"7","author":[{"family":"Poisot","given":"Timothée"},{"family":"Cirtwill","given":"Alyssa R."},{"family":"Cazelles","given":"Kévin"},{"family":"Gravel","given":"Dominique"},{"family":"Fortin","given":"Marie-Josée"},{"family":"Stouffer","given":"Daniel B."}],"editor":[{"family":"Vamosi","given":"Jana"}],"accessed":{"date-parts":[[2016,10,12]]},"issued":{"date-parts":[[2016,3]]}},
  {"id":"Mart92","type":"article-journal","container-title":"The American Naturalist","issue":"6","page":"1208-1218","title":"Constant Connectance in Community Food Webs","URL":"http://www.jstor.org/stable/2462337","volume":"139","author":[{"family":"Martinez","given":"Néo D"}],"issued":{"date-parts":[[1992]]}},
  {"id":"carpenterStanProbabilisticProgramming2017","type":"article-journal","container-title":"Journal of Statistical Software","DOI":"10.18637/jss.v076.i01","ISSN":"1548-7660","issue":"1","language":"en","page":"1-32","source":"www.jstatsoft.org","title":"Stan: A Probabilistic Programming Language","title-short":"Stan","URL":"https://www.jstatsoft.org/index.php/jss/article/view/v076i01","volume":"76","author":[{"family":"Carpenter","given":"Bob"},{"family":"Gelman","given":"Andrew"},{"family":"Hoffman","given":"Matthew D."},{"family":"Lee","given":"Daniel"},{"family":"Goodrich","given":"Ben"},{"family":"Betancourt","given":"Michael"},{"family":"Brubaker","given":"Marcus"},{"family":"Guo","given":"Jiqiang"},{"family":"Li","given":"Peter"},{"family":"Riddell","given":"Allen"}],"accessed":{"date-parts":[[2019,12,21]]},"issued":{"date-parts":[[2017,1,11]]}},
  {"id":"Anon","type":"webpage","title":"Inbox (3,789) - a.a.m.macdonald@gmail.com - Gmail","URL":"https://mail.google.com/mail/u/0/#inbox","accessed":{"date-parts":[[2019,12,23]]}}
]
